app/Controllers/Artikel.php

public function index()
{
     $this->checkLogin();
    $artikelModel = new \App\Models\ArtikelModel();
    $kategoriModel = new \App\Models\KategoriModel();

    $q = $this->request->getGet('q');
    $id_kategori = $this->request->getGet('id_kategori');

    // Dapatkan query builder dari model
    $builder = $artikelModel->builder();

    if ($q) {
        $builder->groupStart()
                ->like('judul', $q)
                ->orLike('isi', $q)
                ->groupEnd();
    }

    if ($id_kategori) {
        $builder->where('id_kategori', $id_kategori);
    }

    // Ambil data artikel berdasarkan query builder
    $artikel = $builder->get()->getResultArray();

    // Ambil semua kategori
    $kategori = $kategoriModel->asArray()->findAll();
---
SELECT *
FROM `artikel`
SELECT *
FROM `kategori`

   public function view($slug)
{
     $this->checkLogin();
    $model = new ArtikelModel();

    // Tambahkan join ke tabel kategori agar bisa ambil nama_kategori
    $artikel = $model
        ->select('artikel.*, kategori.nama_kategori')
        ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
        ->where('slug', $slug)
        ->first();
---
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `slug` = 'benarkah-ijazah-jokowi-palsu'
 LIMIT 1

public function admin_index()
{
    $title = 'Daftar Artikel (Admin)';
    $model = new ArtikelModel();
    $q = $this->request->getVar('q') ?? '';
    $kategori_id = $this->request->getVar('kategori_id') ?? '';
    $sort = $this->request->getVar('sort') ?? 'artikel.id';
    $order = $this->request->getVar('order') ?? 'desc';
    $page = $this->request->getVar('page') ?? 1;

    $builder = $model->table('artikel')
        ->select('artikel.*, kategori.nama_kategori')
        ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

    if ($q != '') {
        $builder->like('artikel.judul', $q);
    }

    if ($kategori_id != '') {
        $builder->where('artikel.id_kategori', $kategori_id);
    }

    $builder->orderBy($sort, $order);

    $artikel = $builder->paginate(10, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%coba coba%' ESCAPE '!'
AND `artikel`.`id_kategori` = '3'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%coba coba%' ESCAPE '!'
AND `artikel`.`id_kategori` = '3'
ORDER BY `artikel`.`id` DESC
 LIMIT 10

        return $this->response->setJSON($data);
    } else {
        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`


    // Jika validasi gagal, ambil kategori untuk dropdown
    $kategoriModel = new KategoriModel();
    $kategori = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`