app/Controllers/Home.php

    public function index()
    {
        // Membuat instance dari ArtikelModel
        $artikelModel = new ArtikelModel();

        // Mengambil artikel terbaru (latest) yang berstatus 'public'
        // dan menggabungkannya dengan data kategori
        $artikelData = $artikelModel
                            ->select('artikel.*, kategori.nama_kategori') // Pilih semua kolom artikel dan nama kategori
                            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left') // Gabungkan tabel kategori
                            ->where('artikel.status', 'public') // Hanya tampilkan artikel dengan status 'public'
                            ->orderBy('artikel.id', 'DESC') // Ini PENTING: Urutkan berdasarkan ID terbaru di atas
                            ->limit(10) // Opsional: Batasi jumlah artikel yang ditampilkan (misalnya 10)
                            ->findAll();
---
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`status` = 'public'
ORDER BY `artikel`.`id` DESC
 LIMIT 10